Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Run the application and notice the `Installed Features` list contains the `greeting-extension` extension.
ja_jp: アプリケーションを実行して、 `Installed Features` のリストに `quarkus-greeting` のエクステンションが含まれていることに注目してください。

source: Run the application as a native
ja_jp: アプリケーションをネイティブバイナリーとして実行

source: Run the application as a native binary
ja_jp: アプリケーションをネイティブ・バイナリとして実行

source: Run the application as a native executable
ja_jp: アプリケーションをネイティブ実行可能ファイルとして実行する

source: Run the application in Dev Mode
ja_jp: アプリケーションをDevモードで実行します。

source: Run the application in JVM mode
ja_jp: JVM モードでアプリケーションを実行する

source: Run the application in Native mode
ja_jp: Native モードでアプリケーションを実行

source: Run the application in dev and JVM modes
ja_jp: devモードとJVMモードでアプリケーションを実行

source: Run the application in dev mode
ja_jp: アプリケーションを開発モードで実行する

source: Run the application in dev mode as explained above, then you can use curl commands to interact with the underlying REST API.
ja_jp: 上で説明したようにアプリケーションを開発モードで実行すると、curl コマンドを使用して基盤となる REST API と対話できます。

source: Run the application in dev mode with:
ja_jp: 次のようにdevモードでアプリケーションを実行します:

source: Run the application in native mode
ja_jp: ネイティブモードでアプリケーションを実行する

source: Run the application in one terminal (make sure you stop any other native executable container runs before executing this):
ja_jp: 1 つのターミナルでアプリケーションを実行します (これを実行する前に、他のネイティブ実行可能コンテナーの実行を必ず停止してください)。

source: Run the application to verify it works as expected. In one terminal:
ja_jp: アプリケーションを実行して、期待通りに動作することを確認します。一つの端末で以下を実行します。

source: Run the application using: `mvn quarkus:dev`.
ja_jp: `mvn quarkus:dev` を使用してアプリケーションを実行します。

source: Run the application with:
ja_jp: 次のコマンドでアプリケーションを実行します。

source: Run the application:
ja_jp: アプリケーションを実行します。

source: Run the curl command once again, stop the binary, generate the flamegraphs and open it:
ja_jp: もう一度curlコマンドを実行し、バイナリを停止し、フレームグラフを生成して開きます。

source: Run the demo
ja_jp: デモの実行

source: Run the following SAM CLI command to locally test your function, passing the appropriate SAM `template`. The `event` parameter takes any JSON file, in this case the sample `payload.json`.
ja_jp: 以下の SAM CLI コマンドを実行して、適切な SAM `template` を渡して関数をローカルでテストします。 `event` パラメーターには任意の JSON ファイルを指定します。この場合はサンプル `payload.json` を指定しています。

source: Run the following SAM CLI command to locally test your lambda function, passing the appropriate SAM `template`. The `event` parameter takes any JSON file, in this case the sample `payload.json`.
ja_jp: 以下の SAM CLI コマンドを実行して、適切な SAM `template` を渡して Lambda Function をローカルでテストします。 `event` パラメーターには任意の JSON ファイルを指定します。この場合はサンプル `payload.json` を指定しています。

source: Run the following binary directly:
ja_jp: 次のバイナリーを直接実行します。

source: Run the following command in the base directory of your Quarkus project to add the `infinispan-client` extension:
ja_jp: Quarkusプロジェクトのベースディレクトリで以下のコマンドを実行し、 `infinispan-client` エクステンションを追加します:

source: Run the following command to renew your Let's Encrypt certificate and set your domain DNS name:
ja_jp: 次のコマンドを実行して、Let's Encrypt 証明書を更新し、ドメインの DNS 名を設定します。

source: Run the microservice in dev mode:
ja_jp: マイクロサービスを開発モードで実行します:

source: Run the native tests using:
ja_jp: 次のようにネイティブテストを実行します:

source: Run the previous Maven command once again and inspect the generated changelog, it should now look like this:
ja_jp: 前述のMavenコマンドをもう一度実行し、生成されたチェンジログを確認してください、以下のようになるはずです:

source: Run the system with:
ja_jp: 次のコマンドでシステムを実行します。

source: Run the test in one of the following ways:
ja_jp: 以下のいずれかの方法でテストを実行します:

source: Run the tests to verify that application still functions correctly.
ja_jp: テストを実行し、アプリケーションがまだ正常に機能していることを確認します。

source: Run the tests to verify the change.
ja_jp: テストを実行して変更を確認します。

source: Run this script in your CLI:
ja_jp: CLI でこのスクリプトを実行します。

source: Run time configuration
ja_jp: 実行時設定

source: Run time logging is configured in the `application.properties` file, for example, to set the default log level to `INFO` logging and include Hibernate `DEBUG` logs:
ja_jp: ランタイムロギングは `application.properties` ファイルで設定します。例えばデフォルトのログレベルを `INFO` ロギングに設定し、Hibernate の `DEBUG` ログを含めるようにします。

source: Run time properties which are optional, and which have had values set at build time or which have a default value, may be explicitly cleared by assigning an empty string to the property. Note that this will _only_ affect runtime properties, and will _only_ work with properties whose values are not required.
ja_jp: 任意であり、ビルド時に値が設定されていたり、デフォルト値が設定されていたりする実行時プロパティーは、空の文字列をプロパティーに代入することで明示的に削除することができます。これは実行時プロパティーに _のみ_ 影響し、値が必須ではないプロパティーで _のみ_ 動作することに注意してください。

source: Run your application in dev mode to use these certificates:
ja_jp: アプリケーションを開発モードで実行して、これらの証明書を使用します。

source: Run your application in dev mode with:
ja_jp: 次のようにdevモードでアプリケーションを実行します:

source: Run your application with:
ja_jp: 次のコマンドでアプリケーションを実行します。

source: Run:
ja_jp: 以下を実行します。

source: Runner jar Example
ja_jp: ランナー jar の例

source: Running Database migration scripts
ja_jp: データベース移行スクリプトの実行

source: Running Infinispan Server
ja_jp: Infinispanサーバの起動

source: Running Locally via Docker Compose
ja_jp: Docker Composeでローカルに実行

source: Running Locally via Quarkus Dev Mode
ja_jp: Quarkus 開発モードでローカルに実行

source: Running Native
ja_jp: ネイティブ実行

source: Running Natively
ja_jp: ネイティブ実行

source: Running Quarkus application behind a reverse proxy
ja_jp: Quarkus アプリケーションのリバースプロキシーの背後での実行

source: Running Quarkus applications and JFR
ja_jp: Quarkus アプリケーションと JFR の実行

source: Running `-DquicklyDocs` produces:
ja_jp: `-DquicklyDocs` の実行は以下を生成します:

source: Running `./mvnw clean install -DskipTests -DskipITs` will do.
ja_jp: `./mvnw clean install -DskipTests -DskipITs` を実行すればOKです。

source: Running `@QuarkusTest` from an IDE
ja_jp: IDE から `@QuarkusTest` を実行する

source: Running a Local Cassandra Database
ja_jp: ローカル Cassandra データベースの実行

source: Running a MongoDB Database
ja_jp: MongoDB データベースの実行

source: Running a Subset of the Application
ja_jp: アプリケーションのサブセットの実行

source: Running an Elasticsearch cluster
ja_jp: Elasticsearchクラスターの実行

source: Running and Using the Application
ja_jp: アプリケーションの実行と使用

source: Running and using the application
ja_jp: アプリケーションの実行と使用

source: Running as a native application
ja_jp: ネイティブアプリケーションとしての実行

source: Running behind a reverse proxy
ja_jp: リバースプロキシーの背後での実行

source: Running in Dev Mode
ja_jp: 開発モードでの実行

source: Running in Developer Mode
ja_jp: デベロッパーモードでの実行

source: Running in JVM Mode
ja_jp: JVMモードでの動作

source: Running in JVM mode
ja_jp: JVM モードでの実行

source: Running in JVM or Native mode
ja_jp: JVM またはネイティブモードでの実行

source: Running in Native Mode
ja_jp: ネイティブモードでの実行

source: Running in dev mode with `mvn clean quarkus:dev`, if you point your browser to `http://localhost:8080/metrics` you should see a list of metrics; search for metrics whose names contain `cassandra`.
ja_jp: `mvn clean quarkus:dev` を使用して開発モードで実行している場合には、ブラウザーで `http://localhost:8080/metrics` を指定するとメトリクスのリストが表示されます。名前に `cassandra` が含まれているメトリクスを検索します。

source: Running in dev mode with `mvn clean quarkus:dev`, if you point your browser to http://localhost:8080/health/ready you should see an output similar to the following one:
ja_jp: `mvn clean quarkus:dev` を使用して開発モードで実行している場合には、ブラウザーで http://localhost:8080/health/ready を指定すると、次のような出力が表示されます。

source: Running in developer mode
ja_jp: 開発者モードで実行

source: Running in native mode
ja_jp: ネイティブモードでの実行

source: Running integration tests
ja_jp: 結合テストの実行

source: Running it is as simple as executing `./target/elasticsearch-low-level-client-quickstart-1.0.0-SNAPSHOT-runner`.
ja_jp: 実行は `./target/elasticsearch-low-level-client-quickstart-1.0-SNAPSHOT-runner` を実行するだけで簡単です。

source: Running it is as simple as executing `./target/hibernate-search-orm-elasticsearch-quickstart-1.0.0-SNAPSHOT-runner`.
ja_jp: 実行は `./target/hibernate-search-orm-elasticsearch-quickstart-1.0-SNAPSHOT-runner` を実行するだけであり簡単です。

source: Running it is as simple as executing `./target/hibernate-search-standalone-elasticsearch-quickstart-1.0.0-SNAPSHOT-runner`.
ja_jp: この実行は、 `./target/hibernate-search-standalone-elasticsearch-quickstart-1.0.0-SNAPSHOT-runner` の実行と同じくらい簡単です。

source: Running it is as simple as executing `./target/mongodb-quickstart-1.0.0-SNAPSHOT-runner`.
ja_jp: 実行は `./target/mongodb-quickstart-1.0-SNAPSHOT-runner` を実行するだけで簡単です。

source: Running it is as simple as executing `./target/rest-json-quickstart-1.0.0-SNAPSHOT-runner`.
ja_jp: 実行は簡単で、 `./target/rest-json-quickstart-1.0-SNAPSHOT-runner` を実行するだけです。

source: Running locally
ja_jp: ローカルでの実行

source: Running native tests
ja_jp: ネイティブテストの実行

source: Running on a Linux system with Podman 3.x installed.
ja_jp: Podman 3.xがインストールされたLinuxシステム上であること

source: Running scheduled operations
ja_jp: スケジュールされたオペレーションの実行

source: Running specific tests
ja_jp: 特定のテストの実行

source: Running the *remote cache* https://infinispan.org/tutorials/[simple code tutorials].
ja_jp: *リモートキャッシュ* link:https://infinispan.org/tutorials/[シンプルコードチュートリアル] を実行する。

source: Running the Application in Dev and JVM modes
ja_jp: 開発モードと JVM モードでのアプリケーションの実行

source: Running the Application in Dev mode
ja_jp: 開発モードでのアプリケーションの実行

source: Running the Application in JVM mode
ja_jp: JVM モードでのアプリケーションの実行

source: Running the Application in Native Mode
ja_jp: ネイティブモードでのアプリケーションの実行

source: Running the Entire Application
ja_jp: アプリケーション全体の実行

source: Running the `jcmd` command give us a list of running Java processes and the PID of each process.
ja_jp: `jcmd` コマンドを実行すると、実行中の Java プロセスのリストと各プロセスの PID が表示されます。

source: Running the above command should return the result below:
ja_jp: 上記のコマンドを実行すると、以下のような結果が返ってくるはずです:

source: Running the application
ja_jp: アプリケーションの実行

source: Running the application in JVM mode
ja_jp: JVM モードでのアプリケーションの実行

source: Running the application in dev mode
ja_jp: 開発モードでのアプリケーションの実行

source: Running the application in native mode
ja_jp: ネイティブモードでアプリケーションの実行

source: Running the application with the AOT cache is just as straightforward:
ja_jp: AOT キャッシュを使用してアプリケーションを実行するのも同様に簡単です。

source: Running the build process in a container is also possible:
ja_jp: コンテナーでビルドプロセスを実行することも可能です:

source: Running the database
ja_jp: データベースの実行

source: Running the health check
ja_jp: ヘルスチェックの実行

source: Running the native executable is as simple as executing `./target/hibernate-search-orm-elasticsearch-quickstart-1.0.0-SNAPSHOT-runner`.
ja_jp: ネイティブ実行可能ファイルを実行することは、 `./target/hibernate-search-orm-elasticsearch-quickstart-1.0.0-SNAPSHOT-runner` を実行することと同じくらい簡単です。

source: Running the server
ja_jp: サーバーの実行

source: Running the tests
ja_jp: テストの実行

source: Running the tests with coverage
ja_jp: カバレッジ付きテストの実行

source: Running this command will run maven in interactive mode and it will ask you to fill in some build properties:
ja_jp: このコマンドを実行すると、インタラクティブモードでmavenが実行され、いくつかのビルドプロパティーの入力を求められます。

source: Running this command, should return the following result:
ja_jp: このコマンドを実行すると、以下のような結果が返ってくるはずです:

source: Running with AOT cache
ja_jp: AOT キャッシュでの実行

source: Running with AppCDS
ja_jp: AppCDS での実行

source: Running with `--verbose` demonstrates how the native-image building process is two sequential java processes:
ja_jp: `--verbose` で実行すると、ネイティブイメージのビルドプロセスが2つの連続したJavaプロセスであることが分かります。

source: Runs integration tests against the container to train the AOT cache.
ja_jp: AOT キャッシュをトレーニングするために、コンテナーに対して統合テストを実行します。

source: Runtime Class Loader
ja_jp: ランタイムクラス ローダー

source: Runtime Classpath check
ja_jp: ランタイムクラスパスチェック

source: Runtime Components
ja_jp: 実行時コンポーネント

source: Runtime Environment
ja_jp: 実行環境

source: Runtime Event
ja_jp: ランタイムイベント

source: Runtime Init
ja_jp: ランタイム初期化

source: Runtime Performance Metrics
ja_jp: 実行時パフォーマンスメトリクス

source: Runtime components in an SBOM generated for an Uber JAR will not include `evidence.occurrences.location` since their content is merged in a single JAR file.
ja_jp: Uber JAR 用に生成された SBOM 内のランタイムコンポーネントに `evidence.occurrences.location` は含まれません。これは、コンテンツが単一の JAR ファイルにマージされるためです。

source: Runtime configuration
ja_jp: ランタイム設定

source: Runtime containers produced by Quarkus to run native executables will not include the tools mentioned above. To explore a native executable within a runtime container, it's best to run the container itself and then `docker cp` the executable locally, e.g.:
ja_jp: ネイティブ実行可能ファイルを実行するために Quarkus によって生成されたランタイムコンテナーには、上記のツールは含まれません。ランタイムコンテナー内のネイティブ実行可能ファイルを調べるには、コンテナー自体を実行してから、実行可能ファイルをローカルで `docker cp` するのが最適です。次に例を示します。

source: Runtime data via JsonRPC
ja_jp: JsonRPC経由の実行時データ

source: Runtime external links
ja_jp: ランタイム外部リンク

source: Runtime filters
ja_jp: ランタイムフィルター

source: Runtime filters by default runs on startup (when the final OpenAPI document gets created). You can change runtime filters to run on every request, making the OpenAPI document dynamic. To do this you need to set this propery: `quarkus.smallrye-openapi.always-run-filter=true`.
ja_jp: ランタイムフィルターは、デフォルトでは起動時 (最終的な OpenAPI ドキュメントが作成される時) に実行されます。ランタイムフィルターを変更して、すべてのリクエストで実行するようにすると、OpenAPI ドキュメントが動的になります。 これを行うには、プロパティー `quarkus.smallrye-openapi.always-run-filter=true` を設定する必要があります。

source: Runtime options, that may be adjusted after the application has been built but before it has been launched.
ja_jp: ランタイムオプション: アプリケーションがビルドされた後、起動する前に調整することができます。

source: Runtime recorder invokes the `IConfigConsumer#loadConfig(...)` method passing in the configuration objects with runtime information.
ja_jp: ランタイムレコーダは `IConfigConsumer#loadConfig(...)` メソッドを呼び出し、ランタイム情報を含む設定オブジェクトを渡します。

source: Runtime recorder registers an invocation of the service instance `stopService` method with the Quarkus `ShutdownContext`.
ja_jp: ランタイムレコーダーは、サービスインスタンスの `stopService` メソッドの呼び出しを Quarkus の `ShutdownContext` に登録します。

source: Runtime recorder retrieves the bean using its type.
ja_jp: ランタイムレコーダは、そのタイプを使用して Bean を取得します。

source: Runtime recorder retrieves the service instance reference and calls its `startService` method.
ja_jp: ランタイムレコーダはサービスインスタンス参照を取得し、その `startService` メソッドを呼び出します。

source: S2I Options
ja_jp: S2I オプション

source: S2I builds require creating a `BuildConfig` and two `ImageStream` resources, one for the builder image and one for the output image. The creation of such objects is being taken care of by the Quarkus Kubernetes extension.
ja_jp: S2I のビルドでは、 `BuildConfig` と 2 つの `ImageStream` リソースを作成する必要があります。このようなオブジェクトの作成は、Quarkus Kubernetes エクステンションによって行われます。

source: SBOMs for Fast JAR packaging type will use the executable JAR file as their main component and record both runtime and build time Quarkus application dependencies.
ja_jp: Fast JAR パッケージングタイプの SBOM は、実行可能な JAR ファイルをメインコンポーネントとして使用し、ランタイムとビルドタイムの Quarkus アプリケーション依存関係を記録します。

source: SBOMs for Uber JARs will use the Uber JAR Maven artifact as their main component.
ja_jp: Uber JAR の SBOM は、Uber JAR Maven アーティファクトをメインコンポーネントとして使用します。

source: SBOMs for native images will use the native executable file as their main component.
ja_jp: ネイティブイメージの SBOM は、ネイティブ実行可能ファイルをメインコンポーネントとして使用します。

source: SBOMs generated for Mutable JAR distributions will also record locations of components that will be used during re-augmentation process using `evidence.occurrences.location` but keeping their `quarkus:component:scope` property set to `development`. For example:
ja_jp: Mutable JAR ディストリビューション用に生成された SBOM は、再拡張プロセス中に使用されるコンポーネントの場所も `evidence.occurrences.location` を使用して記録しますが、 `quarkus:component:scope` プロパティー設定は `development` のまま保持されます。以下はその例です。

source: SCHEMA approach
ja_jp: SCHEMAアプローチ

source: SDKMAN! - for Linux and macOS
ja_jp: SDKMAN! - Linux および macOS 向け

source: SDKMAN! will let you know when new versions are available so updates will be straightforward:
ja_jp: SDKMAN! は、新しいバージョンが利用可能になると通知するので、更新は簡単です。

source: SES Identity Check, follow the process to setup the DKIM verification
ja_jp: SES Identity Checkでは、手順に従ってDKIM認証を設定します

source: SMTP provides various way to use TLS:
ja_jp: SMTP は TLS を使用するさまざまな方法を提供します。

source: SPA integration
ja_jp: SPA 統合

source: SSL Host Name Validation
ja_jp: SSLホスト名の検証

source: SSL client certificate
ja_jp: SSL クライアント証明書

source: SSL cypher
ja_jp: SSL 暗号

source: SSL session id
ja_jp: SSL セッション ID

source: SSL/TLS: The client connects to the server using a secure connection from the start.
ja_jp: SSL/TLS: クライアントは、最初からセキュアな接続を使用してサーバーに接続します。

source: STM objects have state but it doesn't need to be persistent (durable). In fact the default behaviour is for objects managed within transactional memory to be volatile, such that if the service or microservice within which they are being used crashes or is spawned elsewhere, e.g., by a scheduler, all state in memory is lost and the objects start from scratch. But surely you get this and more with JTA (and a suitable transactional datastore) and don't need to worry about restarting your application? Not quite. There's a trade-off here: we're doing away with persistent state and the overhead of reading from and then writing (and sync-ing) to the datastore during each transaction. This makes updates to (volatile) state very fast but you still get the benefits of atomic updates across multiple STM objects (e.g., objects your team wrote then calling objects you inherited from another team and requiring them to make all-or-nothing updates), as well as consistency and isolation in the presence of concurrent threads/users (common in distributed microservices architectures). Furthermore, not all stateful applications need to be durable - even when JTA transactions are used, it tends to be the exception and not the rule. And as you'll see later, because applications can optionally start and control transactions, it's possible to build microservices which can undo state changes and try alternative paths.
ja_jp: STMオブジェクトはステートを持ちますが、永続的である必要はありません。 実際、デフォルトの動作は、トランザクションメモリ内で管理されるオブジェクトが揮発性であることであり、 そのようなオブジェクトが使用されているサービスやマイクロサービスがクラッシュしたり、スケジューラなどによって別の場所でスポーンされたりすると、メモリ内のすべての状態が失われ、オブジェクトはゼロから開始されます。 しかし、JTA（および適切なトランザクションデータストア）を使えば、このようなことが起こり、アプリケーションの再起動を心配する必要はないのでしょうか？そうではありません。 ここでトレードオフがあります。永続的な状態と、トランザクションごとにデータストアから読み込んでデータストアに書き込む（そして同期する）オーバーヘッドをなくしているのです。 これにより（揮発性の）ステートへの更新は非常に高速になりますが、複数のSTMオブジェクト（例えば、あなたのチームが書いたオブジェクトが他のチームから継承したオブジェクトを呼び出し、オール・オア・ナッシングの更新を要求するような場合）にまたがるアトミックな更新や、（分散マイクロサービス・アーキテクチャで一般的な）並行スレッド/ユーザが存在する場合の一貫性と分離の利点は得られます。さらに、すべてのステートフル・アプリケーションが耐久性を必要とするわけではありません。JTAトランザクションが使用される場合でも、それは例外であってルールではありません。後述するように、アプリケーションはオプションでトランザクションを開始したり制御したりできるため、状態の変更を元に戻したり代替経路を試したりできるマイクロサービスを構築することも可能です。

source: STM objects have state, but it doesn't need to be persistent (durable). In fact the default behaviour is for objects managed within transactional memory to be volatile, such that if the service or microservice within which they are being used crashes or is spawned elsewhere, e.g., by a scheduler, all state in memory is lost and the objects start from scratch. But surely you get this and more with JTA (and a suitable transactional datastore) and don't need to worry about restarting your application? Not quite. There's a trade-off here: we're doing away with persistent state and the overhead of reading from and then writing (and sync-ing) to the datastore during each transaction. This makes updates to (volatile) state very fast, but you still get the benefits of atomic updates across multiple STM objects (e.g., objects your team wrote then calling objects you inherited from another team and requiring them to make all-or-nothing updates), as well as consistency and isolation in the presence of concurrent threads/users (common in distributed microservices architectures). Furthermore, not all stateful applications need to be durable - even when JTA transactions are used, it tends to be the exception and not the rule. And as you'll see later, because applications can optionally start and control transactions, it's possible to build microservices which can undo state changes and try alternative paths.
ja_jp: STM オブジェクトには状態 (state) がありますが、永続的 (durable) である必要はありません。実際、デフォルトの動作は、トランザクションメモリー内で管理されているオブジェクトが揮発性になるためのものです。使用されているサービスやマイクロサービスがクラッシュしたり、スケジューラーなどによって別の場所で生成されたりすると、メモリー内のすべてのステートが失われ、オブジェクトはゼロからスタートします。しかし、これは確かに発生する (JTA (と適切なトランザクションデータストア) では特に) ことですが、アプリケーションの再起動を心配する必要はないのでしょうか?そうではありません。ここではトレードオフがあります。永続的な状態と、各トランザクション中にデータストアから読み込み、そして書き込み (および同期) というオーバーヘッドを排除しています。これにより、(揮発性) ステートへの更新は非常に高速になりますが、複数の STM オブジェクト (例えば、自分のチームが書いたオブジェクトが、他のチームから継承したオブジェクトを呼び出して、all-or-nothing 方式の更新を行う必要がある場合など) にまたがるアトミックな更新の利点、同時スレッドユーザーの存在下 (分散マイクロサービスアーテクチャーでは一般的) で一貫性と分離を確立することができます。さらに、すべてのステートフルアプリケーションが耐久性を必要とするわけではありません。これは JTA トランザクションが使用される場合でも、それは例外であってルールではない傾向があります。後述するように、アプリケーションは任意でトランザクションを起動したり制御したりできるので、状態変化を元に戻したり、別のパスを試したりできるマイクロサービスを構築することが可能です。

source: Safe context
ja_jp: セーフコンテキスト

source: Same HTTP requests will fail when invoked from the `formTestMethod` test as Basic authentication is required.
ja_jp: Basic 認証が必要なため、 `formTestMethod` テストから呼び出された場合も同じ HTTP リクエストが失敗します。

source: Same as **DEBUG**.
ja_jp: **DEBUG** と同じ

source: Same as **ERROR**.
ja_jp: **ERROR** と同じ

source: Same as **TRACE**.
ja_jp: **TRACE** と同じ

source: Same as **WARN**.
ja_jp: **WARN** と同じ

source: Same as `quarkus-config-roots.list`, this file may appear in a runtime extension artifact as well in a deployment one. It is generated as part of the extension project build process from the descriptions of configuration options available in the classes annotated with `io.quarkus.runtime.annotations.ConfigRoot` and is not supported to be edited manually.
ja_jp: `quarkus-config-roots.list` と同様に、このファイルはランタイムエクステンションアーティファクトにもデプロイアーティファクトにも表示される場合があります。これは、エクステンションプロジェクトのビルドプロセスの一部として、 `io.quarkus.runtime.annotations.ConfigRoot` でアノテーションが付けられたクラスで使用可能な設定オプションの記述から生成されました。手動での編集はサポートされていません。

source: Same path-matching rules apply as for the `quarkus.http.auth.permission.authenticated.paths=/api/hello` configuration property from the previous example.
ja_jp: 前の例の `quarkus.http.auth.permission.authenticated.paths=/api/hello` 設定プロパティーと同じパス一致ルールが適用されます。

source: SameSite cookies
ja_jp: SameSite クッキー

source: Sample Dockerfile for building with Gradle:
ja_jp: GradleでビルドするためのサンプルDockerfileです:

source: Sample Dockerfile for building with Maven:
ja_jp: MavenでビルドするためのサンプルDockerfileです:

source: Sample JWT Generation Output
ja_jp: JWT 生成出力のサンプル

source: Sample JWT generation output
ja_jp: JWT 生成の出力例

source: Sample Setlist
ja_jp: サンプルセットリスト

source: Sample Test Extension
ja_jp: サンプルテストエクステンション

source: Sample all requests. Set sampler-param to somewhere between 0 and 1, e.g. 0.50, if you do not wish to sample all requests.
ja_jp: すべてのリクエストをサンプリングします。すべてのリクエストをサンプリングしたくない場合は、sampler-param を 0 から 1 の間のどこかに設定します (例: 0.50)。

source: Sample code
ja_jp: サンプルコード

source: Sample multistage Dockerfile for building an image from `scratch`:
ja_jp: `Scratch` からイメージを構築するためのサンプルのマルチステージのDockerfileです:

source: Sampler
ja_jp: サンプラー

source: Sampler CDI Producer
ja_jp: サンプラー CDI プロデューサー

source: Sampler related property names and values change to comply with the latest Java OpenTelemetry SDK. During a transition period it will be possible to set the new configuration values in the old property because we are mapping `quarkus.opentelemetry.tracer.sampler` -> `quarkus.otel.traces.sampler`.
ja_jp: 最新のJava OpenTelemetry SDKに準拠するため、Sampler関連のプロパティ名と値が変更されます。移行期間中は、 `quarkus.opentelemetry.tracer.sampler` → `quarkus.otel.traces.sampler` をマッピングしているため、古いプロパティに新しい設定値を設定することが可能です。

source: Save the JFR events to a file
ja_jp: JFR イベントをファイルに保存する

source: Save the bean class in a `TestBeanBuildItem` for use in a latter RUNTIME_INIT build step that will interact with the bean instances.
ja_jp: Bean クラスを `TestBeanBuildItem` に保存して、Bean インスタンスとインタラクトする後の RUNTIME_INIT ビルドステップで使用できるようにします。

source: Save the file to the `docs/src/main/asciidoc` folder in the `quarkus` repository.
ja_jp: `quarkus` リポジトリの `docs/src/main/asciidoc` フォルダに保存してください。
